OFsolvers/tutorial_cases/disengagement/bubble_column_pbe_20L/0.orig/alpha.gas
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

#include "${FOAM_CASE}/constant/globalVars"

internalField   uniform $alphaGas;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $alphaGas;
    }
    outlet
    {
        type            inletOutlet;
        phi             phi.gas;
        inletValue      uniform 1;
        value           uniform 1;
    }
    defaultFaces
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
