OFsolvers/tutorial_cases/disengagement/bubble_column_pbe_20L/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.gas 0.99
    volScalarFieldValue alpha.liquid 0.01
);

regions
(
    boxToCell
    {
        box (-1.0 -1.0 -1.0) (10 7 10);
        fieldValues
        (
            volScalarFieldValue alpha.gas 0.01
            volScalarFieldValue alpha.liquid 0.99
        );
    }
);


// ************************************************************************* //
